#+TITLE: Periodic Withdrawal Detection
#+AUTHOR: Masaki Waga
#+EMAIL: mwaga@fos.kuis.kyoto-u.ac.jp
#+OPTIONS: toc:nil

This is an example to detect a periodic withdrawal for a certain bank account using [[https://github.com/MasWag/SyMon/][SyMon]].

* Example Execution

Here is an example of the log 

#+BEGIN_SRC txt :tangle example.log
withdraw  1000  0.0
withdraw   200  1.0
withdraw  1200 10.0
withdraw  1300 20.5
withdraw   300 22.0
withdraw  1100 31.2
#+END_SRC

Here is the command to run SyMon with a monitoring result:

#+BEGIN_SRC sh :results output replace :exports both
  cat example.log | 
      ./periodic.symon |
      ./pretty_print.sh
#+END_SRC

#+RESULTS:
: @1.	(time-point 1)	Num: -threshold >= -200	Clock: last_interval = 1, period >= 0, -period >= -2
: @10.	(time-point 2)	Num: threshold > 200, -threshold >= -1000	Clock: last_interval = 10, period >= 9, -period >= -11
: @20.5.	(time-point 3)	Num: threshold > 200, -threshold >= -1000	Clock: 2*last_interval = 21, -period >= -11, 2*period >= 19
: @20.5.	(time-point 3)	Num: threshold > 1000, -threshold >= -1200	Clock: 2*last_interval = 21, 2*period >= 19, -2*period >= -23
: @22.	(time-point 4)	Num: threshold > 1000, -threshold >= -1200	Clock: last_interval = 12, -2*period >= -23, 2*period >= 19
: @22.	(time-point 4)	Num: threshold > 300, -threshold >= -1000	Clock: last_interval = 12, -period >= -11, 2*period >= 19
: @31.2.	(time-point 5)	Num: threshold > 1100, -threshold >= -1200	Clock: 5*last_interval = 106, -2*period >= -23, 2*period >= 19
: @31.2.	(time-point 5)	Num: threshold > 300, -threshold >= -1000	Clock: 10*last_interval = 107, -period >= -11, 10*period >= 97
: @31.2.	(time-point 5)	Num: threshold > 1000, -threshold >= -1100	Clock: 10*last_interval = 107, -2*period >= -23, 10*period >= 97
